[
  {
    "database": "Neo4j",
    "major_version": "2025.11",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Releasing--skip-recoveryand--parallel-downloadas additional options in backup.Backup now deletes downloaded store file after packaging into backup artefact.allow filtering of users along with the--include-metadataoption of the backup command",
      "Enable the use of property index-backed dynamic labels and types when exact-seeking. Note: index-backed support for$anyis not yet implemented due to constraints on deduplication of results.Adds new collection based functions: coll.distinct, coll.flatten, coll.indexOf, coll.insert, coll.max, coll.min, coll.remove, coll.sort.Add new operator MergeUniqueNode speeding up some merge queries when there are uniqueness constraints.Every property change will now result in a change for the database and in the transaction log, even setting the value to the existing one, resolves CVE-2025-12738Replaces error 42N68 with correct 42I58 error code.Fixes bug whereIF NOT EXISTSfor fulltext indexes would mistakenly also match on other indexes on the same schema and not just fulltext indexes:CREATE TEXT INDEX foo FOR (n:Label) ON (n.prop);\nCREATE FULLTEXT INDEX bar IF NOT EXISTS FOR (n:Label) ON EACH [n.prop]; <- No index got created :(Fixes github issue:https://github.com/neo4j/neo4j/issues/13712Add new operator MergeInto speeding up queries likeMATCH (a), (b) MERGE (a)-[r:R]->(b)Performance improvements forSHOW DATABASESwith a large number of databases",
      "Enable the use of property index-backed dynamic labels and types when exact-seeking. Note: index-backed support for$anyis not yet implemented due to constraints on deduplication of results.",
      "Adds new collection based functions: coll.distinct, coll.flatten, coll.indexOf, coll.insert, coll.max, coll.min, coll.remove, coll.sort.",
      "Add new operator MergeUniqueNode speeding up some merge queries when there are uniqueness constraints.",
      "Every property change will now result in a change for the database and in the transaction log, even setting the value to the existing one, resolves CVE-2025-12738",
      "Fixes bug whereIF NOT EXISTSfor fulltext indexes would mistakenly also match on other indexes on the same schema and not just fulltext indexes:",
      "Fixes github issue:https://github.com/neo4j/neo4j/issues/13712",
      "Add new operator MergeInto speeding up queries likeMATCH (a), (b) MERGE (a)-[r:R]->(b)",
      "Performance improvements forSHOW DATABASESwith a large number of databases",
      "Fix backup/dump commands when the target location is a cloud object store and the artefact to store is greater than 8gFixes bug inneo4j-admin database dump, where if the flag--overwrite-destinationwas used, the command could under some circumstances produce a corrupt dump file. This dump file would fail to be loaded by theneo4j-admin database loadcommand with a Zstd error \"Unknown frame descriptor\".Fix possible \"Index 2 out of bounds for length 2\" errors when using excessively long label, relationship type, or property namesFix to not allow migration of a database from block-format to record-standard-format",
      "CVE-2025-11602 Fix init of self-allocated Bolt BitMask"
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.10",
    "patch_version": "1",
    "date": "Date non disponible",
    "changes": [
      "CVE-2025-11602 Fix init of self-allocated Bolt BitMask"
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.10",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Introduced VECTOR as a new type supported by Cypher, Block store format, and v6 drivers.Allow usingnullas default procedure parameter value for all non-primitive types.Append the position and relevant query line with caret to the status description of the last GqlStatusObject cause of errors in the query log and Cypher Shell. This information is part of the legacy error message and has been requested to be part of the new error system as well.Fixes a bug where the values in the options maps of CREATE INDEX and CONSTRAINTS, CREATE DATABASE, ALTER DATABASE commands could become transposedExtended temporal values constructors with additional pattern field. The user-defined pattern defines the structure of the incoming temporal string representation and parses accordingly.Allow using theallReducestep variable in predicate expression.",
      "Fixes a rare issue where malformed tokens (empty string or containing null bytes) could bypass validation and cause database panic.Avoid stack overflow when sorting free IDs for big value storeIntroduce a deny list settingserver.metrics.deny_filterwhich overrides metrics requested inserver.metrics.filter",
      "Fix issue when querying afulltext-1.0index with transaction state relevant to the index, would try and use the incorrect version of Lucene and failing the transaction.Insecure CBC ciphers are removed from defaults in all TLS configurations"
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.09",
    "patch_version": "0",
    "date": "key 1234",
    "changes": [
      "Added--remote-address-resolutionto theneo4j-admin database backupcommand. When used allows the DBMS to determine which servers are valid targets take a backup from for a given database.",
      "Fix for a memory issue that could lead to OutOfMemoryError in physical planning.Increased the cost ofSubtractionNodeByLabelsScan. Planner should preferNodeIndexScanover it more often.Addedformat()function. Theformat()function returns a string representation of a temporal value according to a user-defined pattern.Fix bug that sometimes lead to the wrong result for queries withp=shortestPath()combined with `all(n IN nodes(p) WHERE...)'Fix a bug in pipelined runtime dynamic scheduling that could cause certain queries with multipleSelectOrSemiApplyoperators in the query plan to sometimes fail with error messages like: \"Cannot put key 1234 before first key 1235\".The GQL error code on an invalid allReduce invocation is now 42I51fix a bug where relationship indexes were not returned in theindexescolumn ofSHOW TRANSACTIONSProduction-ready Unix Domain Socket connectorImprove cardinality estimation of queries with:A|Blabel predicates.",
      "Fixes an issue with block format importer where a very long:IDstring could fail the import due internal buffer overflow",
      "Update netty to 4.2.4.Final to resolve CVE‑2025‑55163"
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.08",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Enable dynamic labels by defaultAddedallReduce()function. TheallReduce()function is a boolean expression designed to optimize path expansion in graph database queries. It enables the stepwise evaluation of a value accumulated over a path, allowing for early pruning of paths that do not satisfy a given predicate. This function is equivalent to combining the functionality ofall()andreduce().Fixed bug of large long values overflowing.Implemented correct behavior for aggregations, updating queries andDISTINCTin the context ofUNION,USEand when wrapped in braces when preceded byNEXT. The previously unsupported cases no longer throws an error.Fix an issue where for point index created with a restricted region, sometimes points that fall just outside this region are not returned in distance-based queries. Note that in some scenarios you might need to rebuild the point index in order for the fix to have effect.Allow the alter composite database privilege to be specified per database and not just at dbms level. e.g.GRANT ALTER COMPOSITE DATABASE ON DATABASE foo TO roleFix a bug where creating linked users with a parameter for username will fail to create the second and subsequent users with a constraint violation.",
      "Enable dynamic labels by default",
      "AddedallReduce()function. TheallReduce()function is a boolean expression designed to optimize path expansion in graph database queries. It enables the stepwise evaluation of a value accumulated over a path, allowing for early pruning of paths that do not satisfy a given predicate. This function is equivalent to combining the functionality ofall()andreduce().",
      "Fixed bug of large long values overflowing.",
      "Implemented correct behavior for aggregations, updating queries andDISTINCTin the context ofUNION,USEand when wrapped in braces when preceded byNEXT. The previously unsupported cases no longer throws an error.",
      "Fix an issue where for point index created with a restricted region, sometimes points that fall just outside this region are not returned in distance-based queries. Note that in some scenarios you might need to rebuild the point index in order for the fix to have effect.",
      "Fix a bug where creating linked users with a parameter for username will fail to create the second and subsequent users with a constraint violation.",
      "Update netty to 4.2.4.Final to resolve CVE‑2025‑55163"
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.07",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Add raft processing delay metric which is of type Timer",
      "Allow alter database privileges (including sub-privileges) to be specified per database and not just at dbms level. e.g.GRANT ALTER DATABASE ON DATABASE foo TO roleDENY SET DATABASE DEFAULT LANGUAGE ON DATABASE foo, bar TO roleREVOKE SET DATABASE ACCESS ON DATABASE * FROM roleDynamic labels (for nodes) and dynamic types (for relationships) can now be used in label/type expressions e.g.WHERE n:$($label)Fixes a bug that caused parallel runtime to return incorrect results for queries containing desugared map projections, e.g.,MATCH (n) RETURN n {.*} AS map",
      "Fixes a bug that caused parallel runtime to return incorrect results for queries containing desugared map projections, e.g.,",
      "Removed restrictions on models in VertexAI and Bedrock with the GenAI plugin. This allows current models to be used. The default model used by the plugin for VertexAI has been retired; therefore, the user must explicitly note a model in the configuration map. Some of these models have additional optional parameters, which have been accommodated.Allow multiple:START_ID/:END_IDcolumns inneo4j-admin database importwith CSV.If there are multiple:IDcolumns for a group, it is now allowed to use a matching number of:START_ID/:END_IDcolumns to refer to those IDs.\nAlso fixes a bug with false duplicates with multiple:IDcolumns. E.g. \"AB,CD\" and \"A,BCD\" were treated as duplicates, which has been fixed.Throughput based checkpoint limiter",
      "Removed restrictions on models in VertexAI and Bedrock with the GenAI plugin. This allows current models to be used. The default model used by the plugin for VertexAI has been retired; therefore, the user must explicitly note a model in the configuration map. Some of these models have additional optional parameters, which have been accommodated.",
      "If there are multiple:IDcolumns for a group, it is now allowed to use a matching number of:START_ID/:END_IDcolumns to refer to those IDs.\nAlso fixes a bug with false duplicates with multiple:IDcolumns. E.g. \"AB,CD\" and \"A,BCD\" were treated as duplicates, which has been fixed."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.06",
    "patch_version": "1",
    "date": "in 2025",
    "changes": [
      "Fixed sporadic checkpoint mutex deadlock introduced in 2025.06.0."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.06",
    "patch_version": "0",
    "date": "in 2025",
    "changes": [
      "Fixed sporadic checkpoint and backup errors introduced in 2025.05.Added boolean recovered column in inspect backup command",
      "Allow any IntegralType for parameters when setting topology. Previously only Int was allowed.Introduce query language versioning. The query language can be managed per database. You can specify a query language on database creation and when altering a database. The settingdb.query.default_languagecontrols the default language used for new databases that do not specify an explicit version as part of creation. Individual queries can override the default language with theCYPHER <version>prefix.As part of this change, version 25 of Cypher is now available including the following changes compared to Cypher 5:Add support for walk semantics (relationships can be repeated) with the newREPEATABLE ELEMENTSmatch mode. Trail semantics (relationships are not repeated) is still the default match mode, and can now also be explicitly specified withMATCH DIFFERENT RELATIONSHIPS.Add new syntax from GQL for enclosing certain queries in curly braces (either top-level queries or argument queries to a composite query such asUNIONorUNION ALL).Introduction ofWHEN/ELSEbranches which enable the composition of conditional queries, similar to theIFstatement in other programming languages.Introduction of theFILTERclause which allows mid-query filtering with a dedicated standalone clause. This is a GQL conformant clause.Introduction of theLETclause which allows mid-query projection of additional variables with a dedicated standalone clause. This is a GQL conformant clause.Introduction of a newNEXTkeyword used for the linear composition of queries. This is a GQL conformant keyword.Introduction of 4 new hyperbolic trigonometric functions:coth(),cosh(),sinh()andtanh().TheSHOW TRANSACTIONcolumnsstartTimeandcurrentQueryStartTimechange type toZONED DATETIME(fromSTRING). If not available, set the default to null for the following columns: :clientAddress,outerTransactionId,currentQuery,currentQueryId,parameters,planner,runtime,indexes,currentQueryStartTime,currentQueryElapsedTime,currentQueryCpuTime,currentQueryIdleTime, andcurrentQueryStatus.Allow optional keywordPROPERTYto the uniqueness constraint filtering forSHOW CONSTRAINTS,SHOW [NODE|REL[ATIONSHIP]] [PROPERTY] UNIQUE[NESS] CONSTRAINTS. This also updates the returned constraint types for the uniqueness constraints to include the property keyword,NODE_PROPERTY_UNIQUENESSandRELATIONSHIP_PROPERTY_UNIQUENESS.TheseedCredentialsoption toCREATE DATABASEhas been removed. Credentials for seeding from cloud buckets are now loaded via the cloud providers built-in mechanisms.TheexistingDataoption toCREATE DATABASEis deprecated and has been made optional.An error is now thrown when trying to revoke a privilege that does not exist.Added the optionseedSourceDatabasetoCREATE DATABASE, used to filter the backup artifacts that need to be restored.Administration commands usingWAITwill return the cluster state as notifications instead of as a result.Deprecate theCREATE DATABASEoptionexistingDataSeedInstance. It is replaced by the new optionexistingDataSeedServer.TheindexProvideroption has been removed from the create index and constraint commands.The columnpropertyTypesreturned by the proceduresdb.schema.nodeTypeProperties()anddb.schema.relTypeProperties()previously returned a list of strings representing the potential Java types for a given property. It now returns a list of strings representing the possible Cypher types the given property has.Nodes and relationship are no longer allowed on the right hand side of aSETclause updating properties.String graph references: graph references in graph function arguments containing additional dots apart from the dot separating the composite database and the alias making up a constituent require no quotes of the name part containing dots in Cypher 25, e.g.:USE graph.byName(\"composite.with.dot.constituent\").Ambiguous graph references: Quoting rules for graph references (database names, alias names, composite constituent names) previously allowed to distinguish ambiguous names, for example having a composite constituentcompdb.constituenttogether with a local alias with the namecompdb.constituent. Attempting to create these conflicting graph references now results in a 'Graph reference already exists' exception.Graph reference resolution: In Cypher 25 graph reference resolution has been unified across admin cypher literals, admin cypher parameters, procedures and functions. It is no longer allowed to specify composite and constituent as separate parts (compdb.constituent). Instead, the entire graph reference should be specified as a single symbolic name (compdb.constituent). Whether 'compdb' should be interpreted as a composite or as part of a local alias name is inferred by the existence of a composite with that name.WITHis no longer required as a separator between write and read clauses.UNION [ALL]with different ordering of return items is no longer deprecated.The keywordALLcan now be added after aRETURNandWITHas the explicit form of the clause without duplicate removal.Thereplace()function has been extended with an optionallimitargument.Parameters can now be used inSHORTESTandANYpath patternsIn accordance with GQL, parameters can now begin with extended identifier characters.Subquery expressions no longer use imported variables as grouping variables in aggregations.The character\\u0085(next line) is considered whitespace and not allowed in identifiers.Disallow use of previously deprecated characters in identifiers, see documentation for the full list.Fixed a bug when comparing a node degree expression to a property access.Cypher Shell change the default value of--error-formattogql.This fixes an issue where a hint could not be fulfilled when it was on an OPTIONAL MATCH that was used together with a DISTINCT.fix bug supporting local constituents as a home database",
      "Introduce query language versioning. The query language can be managed per database. You can specify a query language on database creation and when altering a database. The settingdb.query.default_languagecontrols the default language used for new databases that do not specify an explicit version as part of creation. Individual queries can override the default language with theCYPHER <version>prefix.",
      "As part of this change, version 25 of Cypher is now available including the following changes compared to Cypher 5:",
      "Add support for walk semantics (relationships can be repeated) with the newREPEATABLE ELEMENTSmatch mode. Trail semantics (relationships are not repeated) is still the default match mode, and can now also be explicitly specified withMATCH DIFFERENT RELATIONSHIPS.Add new syntax from GQL for enclosing certain queries in curly braces (either top-level queries or argument queries to a composite query such asUNIONorUNION ALL).Introduction ofWHEN/ELSEbranches which enable the composition of conditional queries, similar to theIFstatement in other programming languages.Introduction of theFILTERclause which allows mid-query filtering with a dedicated standalone clause. This is a GQL conformant clause.Introduction of theLETclause which allows mid-query projection of additional variables with a dedicated standalone clause. This is a GQL conformant clause.Introduction of a newNEXTkeyword used for the linear composition of queries. This is a GQL conformant keyword.Introduction of 4 new hyperbolic trigonometric functions:coth(),cosh(),sinh()andtanh().TheSHOW TRANSACTIONcolumnsstartTimeandcurrentQueryStartTimechange type toZONED DATETIME(fromSTRING). If not available, set the default to null for the following columns: :clientAddress,outerTransactionId,currentQuery,currentQueryId,parameters,planner,runtime,indexes,currentQueryStartTime,currentQueryElapsedTime,currentQueryCpuTime,currentQueryIdleTime, andcurrentQueryStatus.Allow optional keywordPROPERTYto the uniqueness constraint filtering forSHOW CONSTRAINTS,SHOW [NODE|REL[ATIONSHIP]] [PROPERTY] UNIQUE[NESS] CONSTRAINTS. This also updates the returned constraint types for the uniqueness constraints to include the property keyword,NODE_PROPERTY_UNIQUENESSandRELATIONSHIP_PROPERTY_UNIQUENESS.TheseedCredentialsoption toCREATE DATABASEhas been removed. Credentials for seeding from cloud buckets are now loaded via the cloud providers built-in mechanisms.TheexistingDataoption toCREATE DATABASEis deprecated and has been made optional.An error is now thrown when trying to revoke a privilege that does not exist.Added the optionseedSourceDatabasetoCREATE DATABASE, used to filter the backup artifacts that need to be restored.Administration commands usingWAITwill return the cluster state as notifications instead of as a result.Deprecate theCREATE DATABASEoptionexistingDataSeedInstance. It is replaced by the new optionexistingDataSeedServer.TheindexProvideroption has been removed from the create index and constraint commands.The columnpropertyTypesreturned by the proceduresdb.schema.nodeTypeProperties()anddb.schema.relTypeProperties()previously returned a list of strings representing the potential Java types for a given property. It now returns a list of strings representing the possible Cypher types the given property has.Nodes and relationship are no longer allowed on the right hand side of aSETclause updating properties.String graph references: graph references in graph function arguments containing additional dots apart from the dot separating the composite database and the alias making up a constituent require no quotes of the name part containing dots in Cypher 25, e.g.:USE graph.byName(\"composite.with.dot.constituent\").Ambiguous graph references: Quoting rules for graph references (database names, alias names, composite constituent names) previously allowed to distinguish ambiguous names, for example having a composite constituentcompdb.constituenttogether with a local alias with the namecompdb.constituent. Attempting to create these conflicting graph references now results in a 'Graph reference already exists' exception.Graph reference resolution: In Cypher 25 graph reference resolution has been unified across admin cypher literals, admin cypher parameters, procedures and functions. It is no longer allowed to specify composite and constituent as separate parts (compdb.constituent). Instead, the entire graph reference should be specified as a single symbolic name (compdb.constituent). Whether 'compdb' should be interpreted as a composite or as part of a local alias name is inferred by the existence of a composite with that name.WITHis no longer required as a separator between write and read clauses.UNION [ALL]with different ordering of return items is no longer deprecated.The keywordALLcan now be added after aRETURNandWITHas the explicit form of the clause without duplicate removal.Thereplace()function has been extended with an optionallimitargument.Parameters can now be used inSHORTESTandANYpath patternsIn accordance with GQL, parameters can now begin with extended identifier characters.Subquery expressions no longer use imported variables as grouping variables in aggregations.The character\\u0085(next line) is considered whitespace and not allowed in identifiers.Disallow use of previously deprecated characters in identifiers, see documentation for the full list.",
      "Fixed a bug when comparing a node degree expression to a property access.",
      "Cypher Shell change the default value of--error-formattogql.",
      "This fixes an issue where a hint could not be fulfilled when it was on an OPTIONAL MATCH that was used together with a DISTINCT.",
      "fix bug supporting local constituents as a home database",
      "Fixes a bug in the GBP-Tree that could cause aGSPP write erroron applying an update to the index, which in turn could cause a database panic by not being able to apply a transaction that had been written to the transaction log. It was a rare case affecting only indexes with values larger than about 4000 bytes, where some values also have to have to have the first ~4000 bytes equivalent to other values. Not only that, but it also depends on the structure of the GBP-Tree at the moment of the update to the index.Existing indexes might have values of this composition already and could possibly still run into theGSPP write erroreven on a version with the fix. It is unlikely, but if it should happen an index rebuild will solve it. Newly created indexes from this version should not have any problems.Fixes an issue dropping a constraint while another constraint or index was created. The end result would be a failure for the transaction dropping the constraint; a retry of that transaction would likely succeed.Fixes an issue where parallel recovery would be less parallel than optimally possible.",
      "Fixes a bug in the GBP-Tree that could cause aGSPP write erroron applying an update to the index, which in turn could cause a database panic by not being able to apply a transaction that had been written to the transaction log. It was a rare case affecting only indexes with values larger than about 4000 bytes, where some values also have to have to have the first ~4000 bytes equivalent to other values. Not only that, but it also depends on the structure of the GBP-Tree at the moment of the update to the index.",
      "Existing indexes might have values of this composition already and could possibly still run into theGSPP write erroreven on a version with the fix. It is unlikely, but if it should happen an index rebuild will solve it. Newly created indexes from this version should not have any problems.",
      "Fixes an issue dropping a constraint while another constraint or index was created. The end result would be a failure for the transaction dropping the constraint; a retry of that transaction would likely succeed.",
      "Fixes an issue where parallel recovery would be less parallel than optimally possible."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.05",
    "patch_version": "1",
    "date": "Date non disponible",
    "changes": [
      "Improves the speed of terminating transactions."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.05",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Update dbms.components procedure to include also supported cypher versionsMove intended debug logging for block format out of the user log (neo4j.log) and into intended location (debug.log)Expose metric about number of virtual threaded tasks from threaded metrics",
      "Fix a bug in pipelined runtime, where in certain scenarios cached properties in an OPTIONAL MATCH were not properly cleared between rows, which could lead to incorrect results.Property-based access control for relationships.",
      "Introduce the settingserver.backup.advertised_address."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.04",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Addition ofdb.cdc.translateIdto allow renamed databases to migrate existing CDC change identifiers to the new databaseAlso changes the DB validation to be based off name rather than UUID - but as this is opaque to the user (they are inside the change identifier) this isn't mentioned in the change logdbms.components() procedure will now return accurate calendar version for the \"Neo4j Kernel\" component.Theinternal.neo4j.custom.versionsystem property will still override procedure output.There is an internal configurationinternal.dbms.custom_kernel_versionwhich can be used to the same effect.The system property takes priority over the internal config.Replaces:https://github.com/neo-technology/neo4j/pull/30267Change output ofneo4j-admin server license, when a license expired, to also inform how many days agothe license expired.On startup, add log messages toneo4j.logthat inform about the license status when evaluating a license.Update CDC to correctly handle recreation of clustered databasesMake DatabaseManagementService AutoCloseableAdds--temp-pathtoneo4j-admin importfor specifying a directory in which temporary files during import will be stored.Adds--max-off-heap-memoryoption toneo4j-admin database migratecommand, so that it's consistent with other commands likeimportandcopyand allows for better control of the amount of memory the process is allowed to allocate. The--pagecacheoption is still supoorted, but considered deprecated.Addstransaction.last_committed_tx_idmetric for tracking lowest available transaction ID present in the transaction logs.",
      "Addition ofdb.cdc.translateIdto allow renamed databases to migrate existing CDC change identifiers to the new database",
      "Also changes the DB validation to be based off name rather than UUID - but as this is opaque to the user (they are inside the change identifier) this isn't mentioned in the change log",
      "Change output ofneo4j-admin server license, when a license expired, to also inform how many days agothe license expired.On startup, add log messages toneo4j.logthat inform about the license status when evaluating a license.",
      "Change output ofneo4j-admin server license, when a license expired, to also inform how many days ago",
      "On startup, add log messages toneo4j.logthat inform about the license status when evaluating a license.",
      "Update CDC to correctly handle recreation of clustered databases",
      "Adds--temp-pathtoneo4j-admin importfor specifying a directory in which temporary files during import will be stored.",
      "Adds--max-off-heap-memoryoption toneo4j-admin database migratecommand, so that it's consistent with other commands likeimportandcopyand allows for better control of the amount of memory the process is allowed to allocate. The--pagecacheoption is still supoorted, but considered deprecated.",
      "Addstransaction.last_committed_tx_idmetric for tracking lowest available transaction ID present in the transaction logs.",
      "Fix a bug that could cause incorrectMixing label expression symbols ('|', '&', '!', and '%') with colon (':') between labels is not allowed...errors.Don't throw a transient when returningstartNodeandendNodeon a deleted relationship.Fixed a bug where EXPLAIN would sometimes report slightly modified return columns if these variables were reused in the query.Remove AggregationSkippedNull warningDatabase alias can now be used as default database.Fix issue in Legacy runtime where relationships created in aFOREACHblock would all be created with a rightward direction ieFOREACH (... | CREATE (a)<-[:R]-(b))would create(a)-[:R]->(b)relationship",
      "Added option--prefer-diff-as-parentto theneo4j-admin database backupcommand.Fix the bug in backup chains that prevented the latest one from being picked up. This caused issues in admin tools likedatabase checkWe deprecate thedbms.cluster.recreateDatabase()procedure in favour ofdbms.recreateDatabase()."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.03",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Fix a bug with relationship traversal cursor pooling that could cause an ExpandInto operator to generate an incorrect relationship match in certain rare queries when executing on a block format database (if the start node of the ExpandInto was created in the same transaction, and it was preceded by another expand operator fused with a limit operator in pipelined runtime).Updateserver.metrics.filterdefault value to include the 'Database data count metrics' (*neo4j.count*) that have replaced the deprecated*ids_in_use*metrics.Fixed a memory leak when starting and stopping databases with unified caches enabled.Ensure global extensions start earlier to prevent incorrect CDC initialization.Add database name and uuid to json log messagesAdd config options for custom Azure blob storage and host authority endpoints. These add support to non-public and/or private cloud Azure deployments.Added the config optionsdbms.integrations.cloud_storage.s3.target_throughput_gbpsanddbms.integrations.cloud_storage.gs.project_idFixes a problem where the experimental feature--parallel-recoveryfor backup and aggregate could fail on trying to apply schema changes out of order with index updates.",
      "FixX1 page does not exist for node -1errors appearing after node deletion.Don't fail withNeo.TransientError.Transaction.Outdatedfor  MERGE clauses withdbms.cypher.lenient_create_relationshipis set totrue. SeeGH issue #13593.Fix issue where...DELETE n RETURN ncould fail in some scenarios.Fix issue where we returnedtrueinstead of the actual property value for some specific WHERE clauses. SeeGH issue #13582.Fix issue where serialization of an empty list inside another list would cause an index out of bounds exception.Fix a bug with Dynamic Relationship Types where the first type would be inadvertently cached and reused for all rows",
      "TLS / SSL configuration can now be updated at run-time.  This feature allows for TLS certificate rotation without the need for a database system restart.  A new setting, dbms.security.tls_reload_enabled, must be set to true to enable this capability."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.02",
    "patch_version": "0",
    "date": "Date non disponible",
    "changes": [
      "Fix issue when index population could skip updates from concurrently transactions when multiple indexes of the different types are populated on the same schemaImprove warnings when using cloud storage paths in admin commands that require directories and the provided paths do not have a terminal '/'Update the import admin tool to use the new --schema option that allows Cypher schema commands to be provided to create indexes/constraints during the incremental import process using the --stage=all mode.NOTE: using the schema option for incremental via --stage=prepare or --stage=build is not supported",
      "Fix issue when index population could skip updates from concurrently transactions when multiple indexes of the different types are populated on the same schema",
      "Improve warnings when using cloud storage paths in admin commands that require directories and the provided paths do not have a terminal '/'",
      "Update the import admin tool to use the new --schema option that allows Cypher schema commands to be provided to create indexes/constraints during the incremental import process using the --stage=all mode.",
      "NOTE: using the schema option for incremental via --stage=prepare or --stage=build is not supported",
      "Reduces the memory consumption of eagerness analysis in Cypher in the presence of unions.The status description for notifications about unrecognized labels (01N50), relationship types (01N51) and properties (01N52) now contains the name of the relevant database.Fixjava.lang.NoSuchFieldError: v0_tokenManagerfor some queries when returning full nodes or relationships.Split NotSystemDatabaseException into NotSystemDatabaseException and DisallowedOnSystemException, where the first is thrown when system-only queries are run towards another database and the latter is thrown when non-system queries are run towards the system database.",
      "Fixes an issue where secondaries attempted to apply a transaction twice. This could happen if transactions were large and/or the transaction pull frequency was high.Add dbms.cluster.raft.async_acquisition_of_raft_sender_channels_enabled. This was before internal.dbms.cluster.raft.async_acquisition_of_raft_sender_channels which has been removeddeprecation of<prefix>.cluster.raft.tx_retriesThe metric*.database.*.cluster.raft.last_leader_messagewill report the value-1until the first message from a leader arrives or the member becomes leader."
    ]
  },
  {
    "database": "Neo4j",
    "major_version": "2025.01",
    "patch_version": "0",
    "date": "GQLSTATUS 4200",
    "changes": [
      "Change debug.log to JSON format by defaultChangesserver.logs.configandserver.logs.user.configsettings to depend on the provided path for theconfdirectory instead of having theconfdirectory encoded in the default values. This fixes a bug where these settings would not respect any none-default configuration directory location.Update the concurrency of S3 downloads to factor in the number of cores available on the machineThe admin commands will now write exception information to a neo4j-admin-exception-trace-DATETIME.log file in the logs folder even if verbose is not enabled. The path to the file is included in the console output.Fixes an issue where dense relationships could be indexed twice. However, this wouldn't produce any functionally error, but could be observable when running consistency check for a database having any Lucene indexes for relationships.All enterprise database are now recreated when restarted after being stopped by the dbms.Fix warning message around usage of Java Compressed Ordinary Object Pointers and heaps in the range of 32-48GUpdate metrics exporter libraryChange config charset from ISO_8859_1 to UTF-8Remove deprecated setting \"db.logs.query.annotation_data_as_json_enabled\". All annotation data is now formatted as JSON by default.New default values. \"db.tx_log.rotation.retention_policy=2 days 2G\" and \"server.metrics.csv.rotation.compression=zip\"Moved log file created by the import admin command to be in a separate file (neo4j-admin-import-DATETIME.log in log folder) rather than using the server debug.log, which can clash with server logging.Fixes an issue removing the last property from a dense relationship, if that property was indexed. Recovery, or clustered apply of that operation would fail.Fixed an issue with DDL, which is not transaction safeAdded two new metricsneo4j.dbms.vm.cpu_load.systemandneo4j.dbms.vm.cpu_load.processexposing equivalent JVM metrics for CPU usage.Updateneo4j-admin server reportcommand to filter metrics by database when--databaseoption is used.Updating the importer's schema command parsing so that variables only apply to each schema commandRenaming Neo4j entry points from CommunityEntryPoint/EnterpriseEntryPoint to Neo4jCommunity/Neo4jEnterpriseAlways create index with default index provider. Index providers don't control the behaviour of an index anymore (since 5.0), and the latest one is always the correct one to use.Remove off heap transaction state",
      "Cypher planner: remove the eagerness analysis logic based on intermediate representation as it was replace by the newer one based on logical plans.The undocumented settingcypher_eager_analysis_implementationis deleted.\nThe cypher query optionCYPHER eagerAnalyzer=[ir | lp]now raises a deprecation warning. It is a no-op. The planner will only ever use the logical plan based implementation regardless of the option provided.Fixes a bug where in certain cases  where the collect function wasn't preserving the order defined in the previous query clause in the parallel runtime.GQLSTATUS 42NA7 is now used as a cause of GQLSTATUS 42002, instead of being used as a top-level error.Allow parameters inSHORTEST k,SHORTEST k GROUPSandANY kpath selectors.When creating a database via seed from URI it can now be restored up to a transaction id or transaction date.Include query language version in query log.We have relaxed the naming rules for databases slightly so they may now start with a digit.",
      "Cypher planner: remove the eagerness analysis logic based on intermediate representation as it was replace by the newer one based on logical plans.",
      "Fixes a bug where in certain cases  where the collect function wasn't preserving the order defined in the previous query clause in the parallel runtime.",
      "Deprecateneo4j-admin database aggregate-backupin favor ofneo4j-admin backup aggregate.Enable hostname verification by default.Decrease the time it takes to deallocate servers that are hosting many databases by allowing leaders to make themself non-voters in the membership set.Introduction ofdbms.quarantineDatabaseprocedure for lifting database quarantine throughout the DBMS.Remove option to set GZIP as compression algorithm for cluster ports",
      "Adding support for the calendar versioningAdding GQL compliant errors and notifications to Browser"
    ]
  }
]